# set() - множества
# 'Это изменяемые неупорядоченный, итерируемый неиндексируемый тип  данных'

# Множества хранят в себе только не изменяемые типы данных 
# a = 'fewb'
# print(hash(a))

# 1 -> set()
# a = set([1,2,3,4])
# print(a)

# a = set({1:2, 3:4})
# print(a)

# 2 - {}
# set2 = {1,2,4}
# print(set2)

# set1 = {1,2,2,2,2,3}
# print(set1)
#{1,2,3} -> сет сохраняет лишь уникальные данные повторки сохранятся не будут

# set1 = {1,0, True, False}
# print(set1)

# a = 0 
# print(bool(a))
#--------------------------------------------------------------------
# Методы set:

# add -> для добавления 
# set11 = {1,2,3}
# set11.add(4)
# print(set11)
# set11.add((1,2,3,4,5))
# set11.add((1,2,3,4,5))
# print(set11)
#--------------------------------------------------------------------------------------------
# update / он может добавлять но не повторять  имеющиеся, добавляет все итерируемые

# set11.update({3:'1', 4: '5'})
# # print(set11)
# set11.update('string', {1,2,3,4,5})
# print(set11)
# set11.update([1,2,3,45,6])
# print(set11)
#-----------------------------------------------------------------------------
# Удаление в Set
# clear -> очищает все множества
# remove(element) -> удаляет элемент если его нету выдает ошибку 
# discard -> Если элемента нету ничего не происходит
#--------------------------------------------------------------------------------
# pop() -> удаляет из set(FIFO) - first in , first out

# set1 = {1,2,3,4,5}
# set1.remove(2)
# set1.clear()
# set1.discard(5)
# print(set1.pop())
# print(set1)
#-------------------------------------------------------------------------------------
# difference() -> выводит отличия 
# set2 = {1,2,3,4,6}
# set4 = {2,3,5,7}
# print(set2.difference(set4))
# print(set4 - set2) #5,7
# print(set2 - set4) # 1,4,6

# set2.symmetric_difference_update(set4)












# print(set2.intersection(set4))  Выводит похожие элементы
# print(set2 & set4)              двух сетов

# print(set2.union(set4)) Объединяет все элементы без повторения
# print(set2 | set4)

# ss = {1,2,3,4,5,6,7,8}
# sa = {5,6,7,8}
# print(ss.difference(sa))

# num1 = list(input())
# print(num1)
# print(len(num1) == len(set(num1)))

# frozenset неизменяемое множество 
# a = frozenset([1,2,3,4,5])
# print(a)

# tuple - неизменяемый, индексируемый , итерируемый уорядоченный тип данных
#index(element) ->   возвращает индекс этого элемента в кортеж
# #литералы - ()
# a = (1, 1, 1)
# print(a, type(a))
# b = tuple()
# #count(element) -> возвращает число вхождений этого элементов в кортеж.
# print(a.count(1))





















ingredients = {"cыр чеддар","грибы", "соус","шпинат"}
ingredients.add('помидор')
ingredients.discard('колбаса')
ingredients.remove('шпинат')
ingredients.add('сыр моцарелла')
ingredients.update('базилик','шпинат')
print(ingredients)


























